[
    {
        "id": "ade-scheduler",
        "title": "My Schedule",
        "subtitles": [
            {
                "id": "what-is",
                "title": "What is My Schedule?",
                "content": "<strong>My Schedule</strong> is a tool that allows you to visualize your schedule in an intuitive way. This site also offers several options such as importing your standard schedule, organizing your different schedules, filtering certain events (for example classes or practical work), integrating your personal activities, visualizing the premises and their location, and many other things!<br><br>Known as ADE Scheduler, this tool was created in August 2019 by three students then entering their master's degree. Their goal was to offer a more complete and user-friendly alternative to the official timetable tool then in place. After five years of growing popularity and use by tens of thousands of students at UCLouvain, it became the official tool in September 2024, changing its name to <strong>My Schedule</strong>.<br><br>Free software originally developed by Gilles Poncelet, Louis Navarre and Jérome Eertmans, <strong>My Schedule</strong> is now maintained by the UCLouvain IT teams."
            },
            {
                "id": "getting-started",
                "title": "Getting started",
                "content": "Here is a video to guide you:",
                "video": "https://www.youtube.com/embed/sFQJggpmYGA"
            }
        ]
    },
    {
        "id": "import",
        "title": "Import my standard schedule",
        "subtitles": [
            {
                "id": "connect-import",
                "title": "Connection and import",
                "content": "When you log in for the first time, My Schedule automatically imports the standard schedule for your course."
            },
            {
                "id": "customize-course",
                "title": "Deselect course codes from the standard schedule",
                "content": "If some elective courses do not apply to you, you can deselect them by clicking on the pencil next to your course code on the left of the schedule page."
            },
            {
                "id": "add-course",
                "title": "Adding course codes",
                "content": "You can add a course that is not in your standard schedule by entering its code (example: LCHIM1111, WFARM2121, BDROI1110, etc.)."
            },
            {
                "id": "select-event",
                "title": "Selecting an event, group, etc.",
                "content": "If you click on an activity in your schedule (or on the pencil next to the course code on the left of the schedule page), you will see all the events contained in this course, by type (lecture, practical work). This option allows you to choose your time groups, for example."
            }
        ]
    },
    {
        "id": "account",
        "title": "Add personal events",
        "subtitles": [
            {
                "id": "custom-events",
                "title": "Create events",
                "content": "Student life is important, but your personal life is even more important! That's why you can add your own custom events to your calendar by clicking on + create an event."
            }
        ]
    },
    {
        "id": "export",
        "title": "Export",
        "content": "<strong>My Schedule</strong> allows you to export your schedule to other calendar applications, such as Gmail (which allows you to import an external calendar) either by downloading an iCal file or via a subscription link.<br><br><p class=\"text-danger\">Warning! We cannot guarantee the frequency of updates because it depends on your calendar application. <strong>My Schedule</strong> therefore remains the official interface for viewing your schedule.<p><br>",
        "subtitles": [
            {
                "id": "ical-file",
                "title": "Download an iCal file",
                "content": "One solution to export your schedule is to download it in iCalendar format. Then, this file can be easily imported into your main calendar. The problem with this approach is that any changes to your schedule will not be reflected in your calendar."
            },
            {
                "id": "sub-link",
                "title": "Subscription links",
                "content": "The best export solution that <strong>My schedule</strong> can offer you is certainly the subscription link. With this link, your calendar application will regularly update your activities (classes and personal events). "
            }
        ]
    }
]
