[
  {
    "id": "ade-scheduler",
    "title": "Mon Horaire",
    "subtitles": [
      {
        "id": "what-is",
        "title": "Qu'est-ce que Mon horaire ?",
        "content": "<strong>Mon horaire</strong> est un outil qui permet de visualiser son horaire de manière intuitive. Ce site offre en plus plusieurs options comme importer votre horaire type, organiser vos différents horaires, filtrer certains évènements (par exemple cours ou TPs), intégrer vos activités personnelles, visualiser les locaux et leur emplacement, et bien d'autres choses encore !<br><br>À l'origine connu sous le nom d'ADE Scheduler, cet outil a été créé en août 2019 par trois étudiants entrant alors en master. Leur objectif était d'offrir une alternative plus complète et plus agréable d'utilisation à l'outil horaire officiel alors mis en place. Après cinq ans de popularité croissante et d'utilisation par des dizaines de milliers d'étudiants à l'UCLouvain, il est devenu l'outil officiel en septembre 2024, changeant au passage de nom pour <strong>Mon Horaire</strong>.<br><br>Logiciel libre développé à l'origine par Gilles Poncelet, Louis Navarre et Jérome Eertmans, <strong>Mon Horaire</strong> est aujourd'hui maintenu par les équipes informatiques de l'UCLouvain."
      },
      {
        "id": "getting-started",
        "title": "Pour débuter",
        "content": "Voici une vidéo pour vous guider :",
        "video": "https://www.youtube.com/embed/sFQJggpmYGA"
      }
    ]
  },
  {
    "id": "import",
    "title": "Importer mon horaire type",
    "subtitles": [
      {
        "id": "connect-import",
        "title": "Connexion et importation",
        "content": "Lorsque vous vous connectez pour la première fois, Mon Horaire importe automatiquement  l’horaire-type de votre formation."
      },
      {
        "id": "customize-course",
        "title": "Désélectionner des codes cours de l’horaire-type",
        "content": "Si certains cours au choix ne vous concernent pas, il est possible de les désélectionner en cliquant sur le crayon à côté du code de votre formation sur la gauche de la page horaire."
      },
      {
        "id": "add-course",
        "title": "Ajout des codes cours",
        "content": "Vous pouvez ajouter un cours qui ne se trouve pas dans votre horaire-type en encodant son code (exemple : LCHIM1111, WFARM2121, BDROI1110…)."
      },
      {
        "id": "select-event",
        "title": "Sélection d’un évènement, groupe…",
        "content": "Si vous cliquez sur une activité de votre planning (ou sur le crayon à côté du code de cours sur la gauche de la page horaire), vous verrez apparaitre tous les évènements contenus dans ce cours, par type (cours magistral, travaux pratiques). Cette option vous permet de choisir vos groupes de tps par exemple."
      }
    ]
  },
  {
    "id": "account",
    "title": "Ajouter des évènements personnels",
    "subtitles": [
      {
        "id": "custom-events",
        "title": "Créer des évènements",
        "content": "La vie étudiante est importante, mais votre vie personnelle l'est encore plus ! C'est pourquoi il vous est possible d'ajouter vos propres évènements personnalisés à votre calendrier en cliquant sur + créer un évènement."
      }
    ]
  },
  {
    "id": "export",
    "title": "Exporter",
    "content": "<strong>Mon horaire</strong> vous permet d’exporter votre planning vers d’autres applications de calendriers, telles que Gmail (qui permettent d'importer un calendrier externe) soit en téléchargeant un fichier iCal soit via un lien d’abonnement.<br><br><p class=\"text-danger\">Attention ! Nous ne pouvons pas garantir la fréquence des mises à jour car elle dépend de l’application de votre calendrier. <strong>Mon horaire</strong> reste donc l’interface officielle de consultation de votre planning.<p><br>",
    "subtitles": [
      {
        "id": "ical-file",
        "title": "Télécharger un fichier iCal",
        "content": "Une solution pour exporter votre horaire est de le télécharger au format iCalendar. Ensuite, ce fichier peut être facilement importé dans votre calendrier principal. Le problème avec cette approche est qu'aucun changement dans votre horaire ne pourra être pris en compte dans votre calendrier."
      },
      {
        "id": "sub-link",
        "title": "Liens d'abonnement",
        "content": "La meilleure solution d’export que peut vous proposer <strong>Mon horaire</strong> est certainement celle du lien d'abonnement. Avec ce lien, votre application de calendrier mettra à jour de manière régulière vos activités (cours et évènements personnels). "
      }
    ]
  }
]
